BSN = 6;%基站数目
%各个基站的位置，3*BSN的矩阵存储，每一列是一个坐标
BS = [
        0 , sqrt(3) , 0.5*sqrt(3) , -0.5*sqrt(3) , -sqrt(3) , -0.5*sqrt(3) , 0.5*sqrt(3); 
        0 ,       0 ,         1.5 ,         1.5  ,        0 ,        -1.5  ,        -1.5; 
        0 ,       0 ,         1.5 ,         1.5  ,        0 ,        -1.5  ,        -1.5
      ];
BS = BS(:,1:BSN);
BS = BS .* 50;

%MS的实际距离,为待测量值
MS = [30,30,30];

% R0为无噪声情况下各个BS与MS的距离
for i = 1:BSN
    R0(i) = sqrt((BS(1,i)-MS(1))^2 + (BS(2,i)-MS(2))^2 + (BS(3,i)-MS(3))^2);
end

%噪声方差
Noise = 1;
%R（i）,是加上噪声后，BSi与BS1到MS的距离差，实际中应由TDOA*c算得（基站和移动台送出的数据计算）
%for i = 1:BSN-1
%    R(i) = R0(i+1) - R0(1) + Noise * randn(1);
%end
R = [17.3477082749703,13.0324148452678,44.5503414498834,74.2974876429252,114.776084308268;]

X = Chan3D(BSN,BS,R)

